app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "postmalone"], ["email", "postmalone@gmail.com"], ["created_at", "2020-09-17 09:11:13.634820"], ["updated_at", "2020-09-17 09:11:13.634820"]]
---
  def create
    user = User.new user_params
    if user.save